Repository: winigajordan/JOEFOUNDHISCRYSTAL
Catalog: translations/messages+intl-icu.*.xlf
Languages: fr

source: Our story
fr: Notre Histoire

source: Our Wedding
fr: Notre mariage

source: I met Christabel on July 1st, 2019, at Murtala Mohamed international airport. Our mutual friend Angela insisted on seeing me off to the airport. We went to the airport lounge for lunch and while there I decided to make Everyone feel at ease, especially her. So I engaged her in a conversation about her field. She was very relaxed and confident while explaining her real estate business.Being a lover of real estate and a civil engineer, We bounded our discussion around it.
fr: J'ai rencontré Christabel le 1er juillet 2019 à l'aéroport international Murtala Mohamed. Notre amie commune Angela a insisté pour m'accompagner à l'aéroport. Nous sommes allés au salon de l'aéroport pour le déjeuner et pendant que j'étais là, j'ai décidé de mettre tout le monde à l'aise, surtout elle. Nous avons ainsi engagé une conversation sur son domaine d’activité. Elle était très détendue et confiante tout en expliquant son expertise dans le domaine immobilier. En tant qu’amoureux de l'immobilier et Ingénieur civil, nous avons limité notre discussion autour de cela.

source: My next visit to Nigeria was on the 28th of November 2019 for business. I gave her a surprise visit to the kingdom hall of Jehovah’s witnesses. when she turned around during the song, she was so shocked to see me. she could not stand on her feet, lol. From there we discussed more business. Most of our discussion was centered around real estate for more than one year.
fr: Ma prochaine visite au Nigéria a eu lieu le 28 novembre 2019 pour affaires. Je lui ai rendu une visite surprise à la salle du royaume des témoins de Jéhovah. Quand elle s'est retournée pendant la chanson, elle était tellement choquée, mais aussi et certainement surprise de me voir. Elle ne pouvait pas tenir debout, lol. De là, nous avons discuté encore d'affaires. La majeure partie de notre discussion a été centrée sur l'immobilier pendant plus d'un an.

source: But I started loving her calm attitude and kindness toward her work and general lifestyle. I ask her why a beautiful lady like her was still single. She laughed and she told me she’s still waiting for a kindhearted man.
fr: Mais j'ai commencé à aimer son attitude calme et sa gentillesse envers son travail et son style de vie en général. Je lui ai demandé pourquoi une belle dame comme elle était toujours célibataire. Elle a ri et m'a dit qu'elle attendait toujours un homme au bon cœur.

source: I jumped on the opportunity, showing her my kind heart and as a french guy,I had to quickly mark my territory lol Since no one was doing so … hahaha. She was a bit confused, but we gradually built trust in each other.
fr: J'ai sauté sur l'occasion, lui montrant mon bon cœur et en bon gentleman, j'ai dû rapidement marquer mon territoire lol Vu que personne ne le faisait… hahaha. Elle était un peu confuse, mais nous nous sommes progressivement fait confiance.

source: I left 2 weeks after, came back Feb 2021 due to covid, our friendship became stronger and stronger, she started seeing me as her best friend, and I always look at her as my partner. We spent 2 weeks together in Feb 2021 and that was when I realized that I will love to spend the rest of my life with her.
fr: J’ai dû par la suite retourner malgré moi, 2 semaines après, puis revenu en février 2021 à cause de la covid. Notre amitié est devenue de plus en plus forte, elle a commencé à me considérer comme son meilleur ami, et je la regardais désormais comme ma partenaire. Nous avons passé 2 semaines ensemble en février 2021 et c'est à ce moment-là que j'ai réalisé que j'adorerais passer le reste de ma vie avec elle.

source: It wasn’t all smooth but patience & Jah’s grace carried us through. I waited another year which means March 2022 to prove my seriousness and commitment. On the 29th of March 2022 at Radisson blu VI Lagos at 9:20 pm, I planned the proposal WITH MOM AND I SPA, Klala films and photo, Radisson blue management and here we are today. I am the happiest man on earth.
fr: Tout n'a pas été facile, mais la patience et la grâce de Jéhovah nous ont permis de traverser ensemble les petites difficultés qui se dressaient devant nous. J'ai attendu une autre année, c'est-à-dire mars 2022, pour prouver mon sérieux et mon engagement. Le 29 mars 2022 au Radisson blu VI Lagos à 21h20, j'ai planifié la proposition AVEC MOM AND I SPA, Klala films and photo, Radisson blue management et nous voilà aujourd'hui. Je suis l'homme le plus heureux de la terre.

source: Baby, I LOVE YOU AND WILL CONTINUE TO LOVE YOU
fr: JE T'AIME ET CONTINUERAI À T'AIMER

source: Registration for
fr: Inscription pour

source: E-Invitation
fr: invitation

source: Saturday October 22nd 2022
fr: Samedi 22 octobre 2022

source: @ Kingdom Hall of Jehovah's
fr: Salle du Royaume des Témoins

source: Witnesses (Lekki Lagos ELF Bus-Stop)
fr: de Jéhovah (arrêt de bus Lekki Lagos ELF)

source: at 10:00 am
fr: à 10h00

source: Wedding Program
fr: Programme du mariage

# Make your gift &amp; Donation
source: Make your gift & Donation
fr: Faites votre cadeau & votre don

source: Wedding Religious ceremony
fr: Mariage religieux

source: Civil registration Wedding
fr: Mariage civil

source: Wedding party
fr: Réception

source: Our Pictures
fr: Nos photos

source: Acknowlegments
fr: Remerciements

source: Registration for E-Invitation
fr: Inscription pour invitation

# Make your Gift &amp; Donation
source: Make your Gift & Donation
fr: Vos dons et cadeaux

source: We thank to all our value guests ( familly, friends, organization)that contributed to make alive this <br>wedding that will be memorable for us. Thank you once again for y'all kind gesture, prayer, advise,<br> encouragements and donation to make it succesful. GLORY to Jehovah GOD.
fr: Nous remercions tous nos précieux invités (famille, amis, organisation) qui ont contribué à faire vivre ce <br>mariage qui sera mémorable pour nous. Merci encore pour votre aimable geste, vos prières, vos conseils,<br> vos encouragements et vos dons pour en faire un succès. GLOIRE à Jéhovah DIEU.

source: Download the invitation card
fr: Télécharger la carte d'invitation

source: Save your place right here
fr: Réservez votre place ici

source: Link to wedding registration
fr: Aller à l'enregistrement au mariage

# Civil Registration&lt;br&gt;Wedding
source: Civil Registration<br>Wedding
fr: Mariage<br>Civil

source: Ikoyi Lagos Friday October 21st 2022
fr: Ikoyi Lagos Vendredi 21 octobre 2022

# Wedding Religious&lt;br&gt; Ceremony
source: Wedding Religious<br> Ceremony
fr: Mariage<br> Religieux

source: Kingdom hall of Jehovah's Witnesses (lekki Lagos ELF BUS-STOP), October 22nd 2022 10:00 AM
fr: Salle du Royaume des Témoins de Jéhovah (lekki Lagos ELF BUS-STOP), le 22 octobre 2022 à 10h00

source: See the location
fr: Voir la localisation

source: Wedding Party
fr: Réception

source: Radisson Blu Anchorage Hotel Lagos , October 22nd 2022 01:00 PM (Limited access, only by e-invitation confirmation or hard copy invitation)
fr: Radisson Blu Anchorage Hotel Lagos, le 22 octobre 2022 à 13h00 (Accès limité, uniquement sur confirmation d'invitation électronique ou sur invitation papier)

source: Scan to see food menu
fr: Scannez pour voir le menu

source: Thank You !!!
fr: Merci !!!

source: Guest Wedding Registration
fr: Invitation au mariage

source: Mr
fr: M.

source: Mrs/ Miss
fr: Mlle/Mme

source: First Name
fr: Prénom(s)

source: Last Name
fr: Nom

source: Whatsapp Number
fr: Numéro Whatsapp

source: Bride's family guest
fr: Invité de la famille de la mariée

source: Groom's family guest
fr: Invitation de la famille du marié

source: Take or Upload Picture
fr: Uploader votre photo

source: For Single
fr: Célibataire

source: For Couple
fr: Pour les couples

source: Make a gift donation
fr: Faire un don

source: Your information
fr: Vos informations

source: Scan to download your information
fr: Scannez pour télécharger <br> vos informations

source: NB: Without your QR code or your<br>information you can’t attend to reception
fr: NB: Sans votre code QR ou vos informations vous ne pouvez pas vous présenter à la réception

source: Relationship with future couple
fr: Invité par

source: See Wedding Program
fr: Voir le programme de mariage

source: Will you attend the ceremony ?
fr: Serez-vous présent à la cérémonie ?

source: Yes, I Will
fr: Oui, je serai présent (à Lagos)

source: No, I can't (Virtual Attendance)
fr: Non, je la suivrai en ligne (Via Zoom)

source: Send
fr: Envoyer

source: Confirm your presence
fr: Confirmation de présence

source: Couple Last Name
fr: Nom

source: Mr First Name
fr: Prénom du partenaire

source: Mme First Name
fr: Prénom de la partenaire

source: Take a picture together
fr: Prenez une photo ensemble

source: Booking hotel
fr: Réservation d'hôtel

source: Home
fr: Accueil

source: Gallery
fr: Galerie

source: Registration
fr: Inscription

source: About Wedding
fr: A propos

source: Contact Us
fr: Contactez-nous

source: JoeFoundHisCrystal. AllRights Reserved
fr: JoeFoundHisCrystal. Tous droits réservés

source: Hotel Reservation
fr: Réservation d'hôtel

source: A discount is available at the BLU RADISSON hotel for<br> people coming from outside the hotel and who want to<br> attend the wedding in person. In order to benefit from this<br> discount, you will need to present your invitation<br> information to the wedding.
fr: Une réduction est disponible à l'hôtel BLU RADISSON pour les personnes <br> venant de l'extérieur de l'hôtel et qui veulent assister au mariage <br> en personne. Afin de bénéficier de cette réduction,<br> vous devrez présenter votre invitation au mariage.

source: Contacts for Reservation (Blu Radisson Hotel)
fr: Contacts pour les réservations (Blu Radisson Hotel)

source: Donation
fr: Dons

source: Number for mobile money donation
fr: Numéro de don par Mobile Money

source: Name
fr: Nom

source: Number Bank account Nigeria
fr: Compte bancaire au Nigeria

source: Language Choice
fr: Choix de langue

source: Number bank account Gabon
fr: Compte bancaire au Gabon

source: Download RIB
fr: Télécharger le RIB

source: Donation with PayPal
fr: Dons avec PayPal

source: Click here
fr: Cliquez ici

source: Hotels are available for those who would like to attend the wedding in person.
fr: Des hôtels sont disponibles pour ceux qui souhaitent assister au mariage en présentiel.

source: Reservation prices
fr: Prix des réservations

source: Contacts for Reservation
fr: Contact pour réserver

source: Donation for Paypal
fr: Don par PayPal

source: AllRights Reserved
fr: Tous droits réservés

source: Made by LINKBRANDYOU Agency
fr: Réalisé par l'agence LINKBRANDYOU

source: Days
fr: Jours

source: Hours
fr: Heures

source: Seconds
fr: Secondes

source: Your gift and donation
fr: Vos dons et cadeaux

source: Bride's guest
fr: Invité de la mariée

source: Groom's guest
fr: Invité du marié

# Your gift &amp; Donation
source: Your gift & Donation
fr: Vos dons et cadeaux

source: Hotel Booking
fr: Réservation d'hôtel

source: Event planner
fr: Coordinatrice du marriage

source: For your reservation for rooms outside hotels mentioned above please contact <br> Mme Runke our wedding Event coordinator for more options via
fr: Pour des reservations de chambres hors hotel vous pouvez contacter Mme Runke (Coordinatrice du marriage) via
